[Survived] StringLiteral
src/app/app.component.ts:11:17
 export class AppComponent {
   title = 'angular-calculator';
   previousInput = 0;
-  superscript = '';
+  superscript = "Stryker was here!";
   input = '';
   equalsJustPressed = false;

[Survived] BooleanLiteral
src/app/app.component.ts:13:23
   previousInput = 0;
   superscript = '';
   input = '';
-  equalsJustPressed = false;
+  equalsJustPressed = true;
   selectedColor = '#A020F0';
 

[Survived] StringLiteral
src/app/app.component.ts:14:19
   superscript = '';
   input = '';
   equalsJustPressed = false;
-  selectedColor = '#A020F0';
+  selectedColor = "";
 
   appendToInput(num: number) {

[Killed] BlockStatement
src/app/app.component.ts:16:30
   equalsJustPressed = false;
   selectedColor = '#A020F0';
 
-  appendToInput(num: number) {
-    if(this.equalsJustPressed) {
-      this.clearInput();
-    }
-    this.input = `${this.input}${num}`;
-  }
+  appendToInput(num: number) {}
 
   clearInput() {
killedBy: AppComponent should render number of button pressed on the screen
statusReason: Expected '' to equal '6'.

[Killed] ConditionalExpression
src/app/app.component.ts:17:8
   selectedColor = '#A020F0';
 
   appendToInput(num: number) {
-    if(this.equalsJustPressed) {
+    if(true) {
       this.clearInput();
     }
killedBy: AppComponent should render multiple numbers pressed appended together on the screen
statusReason: Expected '1' to equal '691'.

[Killed] BlockStatement
src/app/app.component.ts:17:32
   selectedColor = '#A020F0';
 
   appendToInput(num: number) {
-    if(this.equalsJustPressed) {
-      this.clearInput();
-    }
+    if(this.equalsJustPressed) {}
     this.input = `${this.input}${num}`;
   }
killedBy: AppComponent should start and perform a new calculation if new numbers are entered right after =
statusReason: Expected '762' to equal '62'.

[Killed] BlockStatement
src/app/app.component.ts:23:16
     this.input = `${this.input}${num}`;
   }
 
-  clearInput() {
-    this.input = '';
-    this.superscript = '';
-    this.previousInput = 0;
-    this.equalsJustPressed = false;
-  }
+  clearInput() {}
 
   prepareToAdd() {
killedBy: AppComponent should clear text already entered on screen when clear button is pressed
statusReason: Expected '691' to equal ''.

[Killed] StringLiteral
src/app/app.component.ts:24:18
   }
 
   clearInput() {
-    this.input = '';
+    this.input = "Stryker was here!";
     this.superscript = '';
     this.previousInput = 0;
killedBy: AppComponent should clear text already entered on screen when clear button is pressed
statusReason: Expected 'Stryker was here!' to equal ''.

[Killed] StringLiteral
src/app/app.component.ts:25:24
 
   clearInput() {
     this.input = '';
-    this.superscript = '';
+    this.superscript = "Stryker was here!";
     this.previousInput = 0;
     this.equalsJustPressed = false;
killedBy: AppComponent should start and perform a new calculation if new numbers are entered right after =
statusReason: Expected 'Stryker was here!' to equal ''.

[Killed] BooleanLiteral
src/app/app.component.ts:27:30
     this.input = '';
     this.superscript = '';
     this.previousInput = 0;
-    this.equalsJustPressed = false;
+    this.equalsJustPressed = true;
   }
 
killedBy: AppComponent should start and perform a new calculation if new numbers are entered right after =
statusReason: Expected '2' to equal '62'.

[Killed] BlockStatement
src/app/app.component.ts:30:18
     this.equalsJustPressed = false;
   }
 
-  prepareToAdd() {
-    this.previousInput = this.previousInput + parseInt(this.input);
-    this.superscript = `${this.previousInput}`;
-    this.input = '';
-    this.equalsJustPressed = false;
-  }
+  prepareToAdd() {}
 
   executeEquals() {
killedBy: AppComponent should move text already entered on screen to superscript when plus button is pressed
statusReason: Expected '691' to equal ''.

[Killed] ArithmeticOperator
src/app/app.component.ts:31:26
   }
 
   prepareToAdd() {
-    this.previousInput = this.previousInput + parseInt(this.input);
+    this.previousInput = this.previousInput - parseInt(this.input);
     this.superscript = `${this.previousInput}`;
     this.input = '';
killedBy: AppComponent should move text already entered on screen to superscript when plus button is pressed
statusReason: Expected '-691' to equal '691'.

[Killed] StringLiteral
src/app/app.component.ts:33:18
   prepareToAdd() {
     this.previousInput = this.previousInput + parseInt(this.input);
     this.superscript = `${this.previousInput}`;
-    this.input = '';
+    this.input = "Stryker was here!";
     this.equalsJustPressed = false;
   }
killedBy: AppComponent should move text already entered on screen to superscript when plus button is pressed
statusReason: Expected 'Stryker was here!' to equal ''.

[Killed] BooleanLiteral
src/app/app.component.ts:34:30
     this.previousInput = this.previousInput + parseInt(this.input);
     this.superscript = `${this.previousInput}`;
     this.input = '';
-    this.equalsJustPressed = false;
+    this.equalsJustPressed = true;
   }
 
killedBy: AppComponent should add newly entered number to previously entered number after + and = are clicked
statusReason: Expected '64' to equal '314'.

[Killed] BlockStatement
src/app/app.component.ts:37:19
     this.equalsJustPressed = false;
   }
 
-  executeEquals() {
-    this.input = `${this.previousInput + parseInt(this.input)}`;
-    this.previousInput = 0;
-    this.superscript = '';
-    this.equalsJustPressed = true;
-  }
+  executeEquals() {}
 }
 
killedBy: AppComponent should add newly entered number to previously entered number after + and = are clicked
statusReason: Expected '64' to equal '314'.

[Killed] ArithmeticOperator
src/app/app.component.ts:38:21
   }
 
   executeEquals() {
-    this.input = `${this.previousInput + parseInt(this.input)}`;
+    this.input = `${this.previousInput - parseInt(this.input)}`;
     this.previousInput = 0;
     this.superscript = '';
killedBy: AppComponent should add newly entered number to previously entered number after + and = are clicked
statusReason: Expected '186' to equal '314'.

[Killed] BooleanLiteral
src/app/app.component.ts:41:30
     this.input = `${this.previousInput + parseInt(this.input)}`;
     this.previousInput = 0;
     this.superscript = '';
-    this.equalsJustPressed = true;
+    this.equalsJustPressed = false;
   }
 }
killedBy: AppComponent should start and perform a new calculation if new numbers are entered right after =
statusReason: Expected '762' to equal '62'.
